src/OneSBuild/src/Enums/ТипыУслуг/ТипыУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыУслуг</name>
  <enumValues>
    <name>Безлимитная</name>
  </enumValues>
  <enumValues>
    <name>Лимитированная</name>
  </enumValues>
  <enumValues>
    <name>Уникальная</name>
  </enumValues>
</mdclass:Enum>

src/OneSBuild/src/Enums/ТипыУслуг/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Параметры: 
//  ИмяЗначения - Строка
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ТипыУслуг
//	
Функция ЗначениеПоИмени(ИмяЗначения) Экспорт
	
	Если ИмяЗначения = "unlimited" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ТипыУслуг.Безлимитная");
	ИначеЕсли ИмяЗначения = "limited" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ТипыУслуг.Лимитированная");
	ИначеЕсли ИмяЗначения = "unique" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ТипыУслуг.Уникальная");
	Иначе
		Возврат ПредопределенноеЗначение("Перечисление.ТипыУслуг.ПустаяСсылка");
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
